Tekla.Structures.Model.ModelSharingHandler
Handles operations related to model sharing.
The following example demonstrates how to start sharing a model, invite users, and write out changes:
using Tekla.Structures.Model;
using System;
using System.Linq;
using System.Threading.Tasks;
using System.Windows.Forms;
public class Example
{
public async Task Example1()
{
ModelSharingHandler handler = new ModelSharingHandler();
// Start sharing the current model
var shareResult = await handler.StartSharingAsync("PROJECT-001", "Project description");
if (shareResult.Code == SharingResultCode.OK)
{
MessageBox.Show("Model shared successfully. Model ID: " + shareResult.Data);
// Invite a user as editor
var inviteResult = await handler.InviteUserAsync(
"colleague@example.com",
SharingRole.Editor,
sendEmail: true,
customEmailMessage: "Creating the shared model as we agreed previously");
if (inviteResult.Code == SharingResultCode.OK)
{
MessageBox.Show("User invited successfully");
}
// Make some changes and write out
var writeOutResult = await handler.WriteOutAsync("WO-001", "Initial changes");
if (writeOutResult.Code == SharingResultCode.OK)
{
MessageBox.Show("Changes written out successfully");
}
}
else
{
MessageBox.Show("Failed to share model: " + shareResult.ErrorDetails);
}
}
}
The following example demonstrates how to join an existing shared model:
using Tekla.Structures.Model;
using System;
using System.Linq;
using System.Threading.Tasks;
using System.Windows.Forms;
public class Example
{
public async Task Example2()
{
ModelSharingHandler handler = new ModelSharingHandler();
// Get list of available shared models
var modelsResult = await handler.GetModelsAsync();
if (modelsResult.Code == SharingResultCode.OK && modelsResult.Data.Any(model => model.Name == "Model 42"))
{
var firstModel = modelsResult.Data.First(model => model.Name == "Model 42");
// Join the model to a local folder
var joinResult = await handler.JoinAsync(
firstModel.Id,
@"C:\TeklaModels\SharedModels");
if (joinResult.Code == SharingResultCode.OK)
{
MessageBox.Show("Model joined successfully");
}
else
{
MessageBox.Show("Failed to join model: " + joinResult.ErrorDetails);
}
}
}
}
The following example demonstrates how to read in updates from a shared model:
using Tekla.Structures.Model;
using System;
using System.Linq;
using System.Threading.Tasks;
using System.Windows.Forms;
public class Example
{
public async Task Example3()
{
ModelSharingHandler handler = new ModelSharingHandler();
// Get available updates
var updatesResult = await handler.GetUpdatesAsync();
if (updatesResult.Code == SharingResultCode.OK)
{
string message = "Available updates:\n";
foreach (var update in updatesResult.Data)
{
message += string.Format("{0} - {1}: {2}\n",
update.Number,
update.Code,
update.Comment);
}
MessageBox.Show(message);
// Read in all available updates
var readInResult = await handler.ReadInAsync();
if (readInResult.Code == SharingResultCode.OK)
{
MessageBox.Show("Updates read in successfully");
}
else if (readInResult.Code == SharingResultCode.NO_PACKETS_AVAILABLE_TO_READ_IN)
{
MessageBox.Show("Model is already up to date");
}
}
}
}
The following example demonstrates how to create a baseline and handle errors:
using Tekla.Structures.Model;
using System;
using System.Threading.Tasks;
using System.Windows.Forms;
public class Example
{
public async Task Example4()
{
ModelSharingHandler handler = new ModelSharingHandler();
// Create a baseline
var baselineResult = await handler.CreateBaselineAsync("BASELINE-001", "Environment update");
if (baselineResult.Code == SharingResultCode.OK)
{
MessageBox.Show("Baseline created successfully");
}
else
{
// Handle specific error cases
string errorMessage = "Failed to create baseline: ";
switch (baselineResult.Code)
{
case SharingResultCode.MODEL_NOT_SHARED:
errorMessage += "The current model is not shared";
break;
case SharingResultCode.NO_PERMISSION:
errorMessage += "You don't have permission to create baselines";
break;
case SharingResultCode.READ_IN_REQUIRED_BEFORE_WRITE_OUT:
errorMessage += "You must read in the latest updates before creating a baseline";
break;
default:
errorMessage += $"Write out failed. Error code: {baselineResult.Code}";
if (!string.IsNullOrEmpty(baselineResult.ErrorDetails))
{
errorMessage += $", Error details: {baselineResult.ErrorDetails}";
}
break;
}
MessageBox.Show(errorMessage);
}
}
}

Tekla.Structures.Model.ModelSharingHandler.#ctor
Initializes a new instance of the Tekla.Structures.Model.ModelSharingHandler class.

Tekla.Structures.Model.ModelSharingHandler.GetSharingEvents
Gets an instance of Tekla.Structures.Model.ISharingEvents to subscribe to sharing-related events.
Returns:
An Tekla.Structures.Model.ISharingEvents instance for handling sharing events such as Tekla.Structures.Model.ISharingEvents.SharedModelStateChanged.

Tekla.Structures.Model.ModelSharingHandler.InviteUserAsync(System.String,Tekla.Structures.Model.SharingRole,System.Boolean,System.String,System.Nullable{System.Guid})
Invite sharing user.
userEmail: The user email.
role: The user role.
sendEmail: If set, send an invitation email to the new user.
customEmailMessage: If non-empty, add the message to the invitation email. HTML markup can be used.
modelId: If set and nonempty, the model id to invite user to. If not set or empty, user is added to the currently opened model.
Returns: Awaitable task with the operation result.

Tekla.Structures.Model.ModelSharingHandler.GetModelsAsync
Gets the list of shared models available for the current user.
Returns:
An awaitable task that returns an Tekla.Structures.Model.ISharingResult containing a collection of Tekla.Structures.Model.ISharedModel.

Tekla.Structures.Model.ModelSharingHandler.StartSharingAsync(System.String,System.String,System.Nullable{System.Guid})
Starts sharing a model with the specified code, description, and location.
code: The sharing code for the model.
description: A description for the shared model.
location: The location of the shared model. If not provided or empty, the default location is used.
Returns:
An awaitable task that returns an Tekla.Structures.Model.ISharingResult`1 containing the unique identifier of the shared model.

Tekla.Structures.Model.ModelSharingHandler.GetLocationsAsync
Gets the list of available locations for shared models.
Returns:
An awaitable task that returns information about available locations.

Tekla.Structures.Model.ModelSharingHandler.GetUpdatesAsync(System.Nullable{System.Guid})
Get available updates for the model.
modelId: The model id. If not provided or empty, the currently opened model is used.
Returns: An awaitable task that returns a list of udpates.

Tekla.Structures.Model.ModelSharingHandler.JoinAsync(System.Guid,System.String,System.Nullable{System.Guid})
Joins a shared model using the specified model identifier and join folder.
modelId: The model identifier.
joinFolder: The folder to join to.
targetUpdate: The update to join to. If not set or empty, join to the latest update.
Returns:

Tekla.Structures.Model.ModelSharingHandler.ReadInAsync(System.Nullable{System.Guid})
Reads in updates to the shared model.
targetUpdate: The update to read in. If not set or empty, reads in to the latest update.
Returns:
An awaitable task that returns an Tekla.Structures.Model.ISharingResult indicating the result of the read-in operation.

Tekla.Structures.Model.ModelSharingHandler.WriteOutAsync(System.String,System.String,System.String)
Writes out changes to the service with the specified code and comment. Automatically release the next write-out reservation if there is one.
code: The code for the write-out operation.
comment: A comment describing the write-out.
releaseNextWriteOutComment: Optional. A comment for releasing the next write-out reservation. If provided, must not be empty.
Returns:
An awaitable task that returns an Tekla.Structures.Model.ISharingResult indicating the result of the write-out operation.

Tekla.Structures.Model.ModelSharingHandler.CreateBaselineAsync(System.String,System.String,System.String)
Make a new baseline and upload it to the service with the specified code and comment.
code: The code for the write-out operation.
comment: A comment describing the write-out.
releaseNextWriteOutComment: Optional. A comment for releasing the next write-out reservation. If provided, must not be empty.
Returns:
An awaitable task that returns an Tekla.Structures.Model.ISharingResult indicating the result of the making baseline operation.

Tekla.Structures.Model.ModelSharingHandler.ReserveNextWriteOutAsync(System.String)
Reserves the next write-out for the current user with the specified comment.
comment: A comment describing the reason for the reservation. Must not be empty or whitespace.
Returns:
An awaitable task that returns an Tekla.Structures.Model.ISharingResult indicating the result of the reserve operation.

Tekla.Structures.Model.ModelSharingHandler.ReleaseNextWriteOutAsync(System.String)
Releases a previously reserved next write-out for the current user with the specified comment.
comment: A comment describing the reason for the release. Must not be empty or whitespace.
Returns:
An awaitable task that returns an Tekla.Structures.Model.ISharingResult indicating the result of the release operation.

Tekla.Structures.Model.ModelSharingHandler.RemoveModelAsync(System.Guid)
Removes the shared model from the system.
modelId: The identifier of the model to be removed.
Returns:
An awaitable task that returns an Tekla.Structures.Model.ISharingResult indicating the result of the remove operation.

Tekla.Structures.Model.ModelSharingHandler.ExcludeAndOpen(System.String)
Excludes the specified model from sharing and opens it. The currently opened model is closed.
modelPath: The path to the model to exclude from sharing and open.
Returns:
An Tekla.Structures.Model.ISharingResult indicating the result of the operation.